#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
sgs-redis-01-private-endpoint/privateDnsZoneGroups/io-p-itn-msgs-redis-01-private-dns-zone-group" -> (known after apply)
            name                 = "io-p-itn-msgs-redis-01-private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-msgs-redis-01-private-service-connection"
          ~ private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Cache/redis/io-p-itn-msgs-redis-01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.20.2.26" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.redis_messages.azurerm_redis_cache.this must be replaced
-/+ resource "azurerm_redis_cache" "this" {
      ~ hostname                      = "io-p-itn-msgs-redis-01.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Cache/redis/io-p-itn-msgs-redis-01" -> (known after apply)
        name                          = "io-p-itn-msgs-redis-01"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> "6"
      ~ replicas_per_master           = 1 -> (known after apply)
      ~ replicas_per_primary          = 1 -> (known after apply)
      ~ resource_group_name           = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      - tenant_settings               = {} -> null
        # (8 unchanged attributes hidden)

      ~ redis_configuration {
          - active_directory_authentication_enabled = false -> null
          - aof_backup_enabled                      = false -> null
          ~ maxclients                              = 7500 -> (known after apply)
          ~ maxfragmentationmemory_reserved         = 642 -> (known after apply)
          ~ maxmemory_delta                         = 642 -> (known after apply)
          ~ maxmemory_reserved                      = 642 -> (known after apply)
          - rdb_backup_frequency                    = 0 -> null
          - rdb_backup_max_snapshot_count           = 0 -> null
            # (4 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app.this must be replaced
-/+ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_CONNECTION_STRING"                   = (sensitive value)
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          - "BACKEND_BASE_URL"                                = "https://io-p-app-appbackendli.azurewebsites.net"
          - "BACKEND_TOKEN"                                   = (sensitive value)
          - "COSMOSDB_KEY"                                    = (sensitive value)
          - "COSMOSDB_NAME"                                   = "db"
          - "COSMOSDB_URI"                                    = "https://io-p-cosmos-api.documents.azure.com:443/"
          - "FETCH_KEEPALIVE_ENABLED"                         = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "4"
          - "INTERNAL_USER_ID"                                = (sensitive value)
          - "MESSAGE_CONTAINER_NAME"                          = "message-content"
          - "MESSAGE_CONTENT_STORAGE_CONNECTION_STRING"       = (sensitive value)
          - "NODE_ENV"                                        = "production"
          - "NOTIFICATION_QUEUE_NAME"                         = "push-notifications"
          - "NOTIFICATION_QUEUE_STORAGE_CONNECTION_STRING"    = (sensitive value)
          - "RC_CONFIGURATION_CACHE_TTL"                      = "28800"
          - "REDIS_PASSWORD"                                  = (sensitive value)
          - "REDIS_PORT"                                      = "6380"
          - "REDIS_URL"                                       = "io-p-itn-msgs-redis-01.redis.cache.windows.net"
          - "REMOTE_CONTENT_COSMOSDB_KEY"                     = (sensitive value)
          - "REMOTE_CONTENT_COSMOSDB_NAME"                    = "remote-content"
          - "REMOTE_CONTENT_COSMOSDB_URI"                     = "https://io-p-messages-remote-content.documents.azure.com:443/"
          - "SLOT_TASK_HUBNAME"                               = "ProductionTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        } -> (known after apply)
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "io-p-itn-msgs-sending-func-01.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "functionapp,linux" -> (known after apply)
        name                                           = "io-p-itn-msgs-sending-func-01"
      ~ outbound_ip_address_list                       = [
          - "4.232.8.33",
          - "4.232.9.59",
          - "4.232.9.61",
          - "4.232.9.45",
          - "4.232.9.63",
          - "4.232.9.80",
          - "4.232.99.1",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "4.232.8.33,4.232.9.59,4.232.9.61,4.232.9.45,4.232.9.63,4.232.9.80,4.232.99.1" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "4.232.9.126",
          - "4.232.9.127",
          - "4.232.9.205",
          - "4.232.9.206",
          - "4.232.9.90",
          - "4.232.9.91",
          - "4.232.8.208",
          - "4.232.8.254",
          - "4.232.9.117",
          - "4.232.9.32",
          - "4.232.9.34",
          - "4.232.9.49",
          - "4.232.9.51",
          - "4.232.9.4",
          - "4.232.9.113",
          - "4.232.9.192",
          - "4.232.9.194",
          - "4.232.9.56",
          - "4.232.8.33",
          - "4.232.9.59",
          - "4.232.9.61",
          - "4.232.9.45",
          - "4.232.9.63",
          - "4.232.9.80",
          - "4.232.9.126",
          - "4.232.9.127",
          - "4.232.9.205",
          - "4.232.9.206",
          - "4.232.9.90",
          - "4.232.9.91",
          - "4.232.9.83",
          - "4.232.9.85",
          - "4.232.9.87",
          - "4.232.9.121",
          - "4.232.9.123",
          - "4.232.9.89",
          - "4.232.99.1",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "4.232.9.126,4.232.9.127,4.232.9.205,4.232.9.206,4.232.9.90,4.232.9.91,4.232.8.208,4.232.8.254,4.232.9.117,4.232.9.32,4.232.9.34,4.232.9.49,4.232.9.51,4.232.9.4,4.232.9.113,4.232.9.192,4.232.9.194,4.232.9.56,4.232.8.33,4.232.9.59,4.232.9.61,4.232.9.45,4.232.9.63,4.232.9.80,4.232.9.126,4.232.9.127,4.232.9.205,4.232.9.206,4.232.9.90,4.232.9.91,4.232.9.83,4.232.9.85,4.232.9.87,4.232.9.121,4.232.9.123,4.232.9.89,4.232.99.1" -> (known after apply)
      ~ resource_group_name                            = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
      ~ service_plan_id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-msgs-sending-asp-01" -> (known after apply)
      ~ site_credential                                = (sensitive value)
      ~ tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + zip_deploy_file                                = (known after apply)
        # (15 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "c491ddaa-5017-4566-a823-c02359c72ab0" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ site_config {
          ~ app_scale_limit                         = 0 -> (known after apply)
          - application_insights_key                = (sensitive value) -> null
          ~ default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled          = false -> (known after apply)
          ~ elastic_instance_minimum                = 1 -> (known after apply)
          ~ linux_fx_version                        = "NODE|20" -> (known after apply)
          ~ pre_warmed_instance_count               = 0 -> (known after apply)
          + remote_debugging_version                = (known after apply)
          - runtime_scale_monitoring_enabled        = false -> null
          ~ scm_type                                = "None" -> (known after apply)
          ~ worker_count                            = 1 -> (known after apply)
            # (17 unchanged attributes hidden)

          ~ application_stack {
              - use_custom_runtime          = false -> null
                # (2 unchanged attributes hidden)
            }
        }

      ~ sticky_settings {
          - connection_string_names = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app_slot.this[0] must be replaced
-/+ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_CONNECTION_STRING"                   = (sensitive value)
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          - "AzureFunctionsWebHost__hostid"                   = "staging"
          - "BACKEND_BASE_URL"                                = "https://io-p-app-appbackendli.azurewebsites.net"
          - "BACKEND_TOKEN"                                   = (sensitive value)
          - "COSMOSDB_KEY"                                    = (sensitive value)
          - "COSMOSDB_NAME"                                   = "db"
          - "COSMOSDB_URI"                                    = "https://io-p-cosmos-api.documents.azure.com:443/"
          - "FETCH_KEEPALIVE_ENABLED"                         = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "4"
          - "INTERNAL_USER_ID"                                = (sensitive value)
          - "MESSAGE_CONTAINER_NAME"                          = "message-content"
          - "MESSAGE_CONTENT_STORAGE_CONNECTION_STRING"       = (sensitive value)
          - "NODE_ENV"                                        = "production"
          - "NOTIFICATION_QUEUE_NAME"                         = "push-notifications"
          - "NOTIFICATION_QUEUE_STORAGE_CONNECTION_STRING"    = (sensitive value)
          - "RC_CONFIGURATION_CACHE_TTL"                      = "28800"
          - "REDIS_PASSWORD"                                  = (sensitive value)
          - "REDIS_PORT"                                      = "6380"
          - "REDIS_URL"                                       = "io-p-itn-msgs-redis-01.redis.cache.windows.net"
          - "REMOTE_CONTENT_COSMOSDB_KEY"                     = (sensitive value)
          - "REMOTE_CONTENT_COSMOSDB_NAME"                    = "remote-content"
          - "REMOTE_CONTENT_COSMOSDB_URI"                     = "https://io-p-messages-remote-content.documents.azure.com:443/"
          - "SLOT_TASK_HUBNAME"                               = "StagingTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        } -> (known after apply)
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "io-p-itn-msgs-sending-func-01-staging.azurewebsites.net" -> (known after apply)
      ~ function_app_id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01" # forces replacement -> (known after apply) # forces replacement
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01/slots/staging" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "functionapp,linux" -> (known after apply)
        name                                           = "staging"
      ~ outbound_ip_address_list                       = [] -> (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      ~ possible_outbound_ip_address_list              = [] -> (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      ~ site_credential                                = (sensitive value)
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (14 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "d348f05a-91fc-42b7-8e35-c11f032fa6c7" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ site_config {
          ~ app_scale_limit                         = 0 -> (known after apply)
          - application_insights_key                = (sensitive value) -> null
          ~ default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled          = false -> (known after apply)
          ~ elastic_instance_minimum                = 1 -> (known after apply)
          ~ linux_fx_version                        = "NODE|20" -> (known after apply)
          ~ pre_warmed_instance_count               = 0 -> (known after apply)
          + remote_debugging_version                = (known after apply)
          - runtime_scale_monitoring_enabled        = false -> null
          ~ scm_type                                = "None" -> (known after apply)
          ~ worker_count                            = 1 -> (known after apply)
            # (17 unchanged attributes hidden)

          ~ application_stack {
              - use_custom_runtime          = false -> null
                # (2 unchanged attributes hidden)
            }
        }
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_monitor_metric_alert.function_app_health_check[0] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-msgs-sending-func-01] Health Check Failed" -> (known after apply)
        name                     = "io-p-itn-msgs-sending-func-01] Health Check Failed"
      ~ resource_group_name      = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (6 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_monitor_metric_alert.storage_account_health_check[0] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnmsgssendingstfn01] Low Availability" -> (known after apply)
        name                     = "[iopitnmsgssendingstfn01] Low Availability"
      ~ resource_group_name      = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (6 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_private_endpoint.function_sites must be replaced
-/+ resource "azurerm_private_endpoint" "function_sites" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-func-pep-01" -> (known after apply)
        name                     = "io-p-itn-msgs-sending-func-pep-01"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-msgs-sending-func-pep-01.nic.c8e5c319-d370-45d8-bab9-b4bd793442d2"
              - name = "io-p-itn-msgs-sending-func-pep-01.nic.c8e5c319-d370-45d8-bab9-b4bd793442d2"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-func-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.azurewebsites.net"
              - name                = "privatelink.azurewebsites.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net"
              - record_sets         = [
                  - {
                      - fqdn         = "io-p-itn-msgs-sending-func-01.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.20.2.21",
                        ]
                      - name         = "io-p-itn-msgs-sending-func-01"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "io-p-itn-msgs-sending-func-01.scm.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.20.2.21",
                        ]
                      - name         = "io-p-itn-msgs-sending-func-01.scm"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name      = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-func-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-msgs-sending-func-pep-01"
          ~ private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.20.2.21" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_private_endpoint.st_blob must be replaced
-/+ resource "azurerm_private_endpoint" "st_blob" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-blob-pep-01" -> (known after apply)
        name                     = "io-p-itn-msgs-sending-blob-pep-01"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-msgs-sending-blob-pep-01.nic.f4e36177-ddf5-4187-a455-77437c3c04cd"
              - name = "io-p-itn-msgs-sending-blob-pep-01.nic.f4e36177-ddf5-4187-a455-77437c3c04cd"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-blob-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iopitnmsgssendingstfn01.privatelink.blob.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.19",
                        ]
                      - name         = "iopitnmsgssendingstfn01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name      = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-blob-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-msgs-sending-blob-pep-01"
          ~ private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.20.2.19" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_private_endpoint.st_file must be replaced
-/+ resource "azurerm_private_endpoint" "st_file" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-file-pep-01" -> (known after apply)
        name                     = "io-p-itn-msgs-sending-file-pep-01"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-msgs-sending-file-pep-01.nic.a5d89b1e-9f4c-4da0-8ea2-2d45ccb3f030"
              - name = "io-p-itn-msgs-sending-file-pep-01.nic.a5d89b1e-9f4c-4da0-8ea2-2d45ccb3f030"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-file-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.file.core.windows.net"
              - name                = "privatelink.file.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iopitnmsgssendingstfn01.privatelink.file.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.18",
                        ]
                      - name         = "iopitnmsgssendingstfn01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name      = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-file-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-msgs-sending-file-pep-01"
          ~ private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.20.2.18" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_private_endpoint.st_queue must be replaced
-/+ resource "azurerm_private_endpoint" "st_queue" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-queue-pep-01" -> (known after apply)
        name                     = "io-p-itn-msgs-sending-queue-pep-01"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-msgs-sending-queue-pep-01.nic.2b2ca379-a79d-49fc-bd72-be184b1f5a7a"
              - name = "io-p-itn-msgs-sending-queue-pep-01.nic.2b2ca379-a79d-49fc-bd72-be184b1f5a7a"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-queue-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              - name                = "privatelink.queue.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iopitnmsgssendingstfn01.privatelink.queue.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.20",
                        ]
                      - name         = "iopitnmsgssendingstfn01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name      = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-queue-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-msgs-sending-queue-pep-01"
          ~ private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.20.2.20" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_private_endpoint.staging_function_sites[0] must be replaced
-/+ resource "azurerm_private_endpoint" "staging_function_sites" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-staging-func-pep-01" -> (known after apply)
        name                     = "io-p-itn-msgs-sending-staging-func-pep-01"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-msgs-sending-staging-func-pep-01.nic.47b0a339-1457-4441-a515-036fad63692f"
              - name = "io-p-itn-msgs-sending-staging-func-pep-01.nic.47b0a339-1457-4441-a515-036fad63692f"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-staging-func-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.azurewebsites.net"
              - name                = "privatelink.azurewebsites.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net"
              - record_sets         = [
                  - {
                      - fqdn         = "io-p-itn-msgs-sending-func-01-staging.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.20.2.22",
                        ]
                      - name         = "io-p-itn-msgs-sending-func-01-staging"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "io-p-itn-msgs-sending-func-01-staging.scm.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.20.2.22",
                        ]
                      - name         = "io-p-itn-msgs-sending-func-01-staging.scm"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name      = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-sending-staging-func-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-msgs-sending-staging-func-pep-01"
          ~ private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.20.2.22" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_role_assignment.function_storage_account_contributor must be replaced
-/+ resource "azurerm_role_assignment" "function_storage_account_contributor" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01/providers/Microsoft.Authorization/roleAssignments/ff29ab8f-5446-41ab-9dbc-dfc733342c75" -> (known after apply)
      ~ name                             = "ff29ab8f-5446-41ab-9dbc-dfc733342c75" -> (known after apply)
      ~ principal_id                     = "c491ddaa-5017-4566-a823-c02359c72ab0" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_role_assignment.function_storage_blob_data_owner must be replaced
-/+ resource "azurerm_role_assignment" "function_storage_blob_data_owner" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01/providers/Microsoft.Authorization/roleAssignments/565f16de-74af-222d-44c8-936798423263" -> (known after apply)
      ~ name                             = "565f16de-74af-222d-44c8-936798423263" -> (known after apply)
      ~ principal_id                     = "c491ddaa-5017-4566-a823-c02359c72ab0" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_role_assignment.function_storage_queue_data_contributor must be replaced
-/+ resource "azurerm_role_assignment" "function_storage_queue_data_contributor" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01/providers/Microsoft.Authorization/roleAssignments/852e488b-a909-9615-f525-287976a9f5cb" -> (known after apply)
      ~ name                             = "852e488b-a909-9615-f525-287976a9f5cb" -> (known after apply)
      ~ principal_id                     = "c491ddaa-5017-4566-a823-c02359c72ab0" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_role_assignment.staging_function_storage_account_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "staging_function_storage_account_contributor" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01/providers/Microsoft.Authorization/roleAssignments/cf0cde31-fb2d-8ec9-c95d-484ecc013511" -> (known after apply)
      ~ name                             = "cf0cde31-fb2d-8ec9-c95d-484ecc013511" -> (known after apply)
      ~ principal_id                     = "d348f05a-91fc-42b7-8e35-c11f032fa6c7" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_role_assignment.staging_function_storage_blob_data_owner[0] must be replaced
-/+ resource "azurerm_role_assignment" "staging_function_storage_blob_data_owner" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01/providers/Microsoft.Authorization/roleAssignments/dd38cab9-a059-d5fc-81ef-9fac7ebf3428" -> (known after apply)
      ~ name                             = "dd38cab9-a059-d5fc-81ef-9fac7ebf3428" -> (known after apply)
      ~ principal_id                     = "d348f05a-91fc-42b7-8e35-c11f032fa6c7" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_role_assignment.staging_function_storage_queue_data_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "staging_function_storage_queue_data_contributor" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01/providers/Microsoft.Authorization/roleAssignments/bc25e726-242d-4f76-ef2b-ec960155c859" -> (known after apply)
      ~ name                             = "bc25e726-242d-4f76-ef2b-ec960155c859" -> (known after apply)
      ~ principal_id                     = "d348f05a-91fc-42b7-8e35-c11f032fa6c7" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_service_plan.this[0] must be replaced
-/+ resource "azurerm_service_plan" "this" {
      ~ id                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-msgs-sending-asp-01" -> (known after apply)
      ~ kind                         = "linux" -> (known after apply)
      ~ maximum_elastic_worker_count = 3 -> (known after apply)
        name                         = "io-p-itn-msgs-sending-asp-01"
      ~ reserved                     = true -> (known after apply)
      ~ resource_group_name          = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      ~ worker_count                 = 3 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_storage_account.this must be replaced
-/+ resource "azurerm_storage_account" "this" {
      ~ access_tier                        = "Hot" -> (known after apply)
      ~ id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01" -> (known after apply)
      + large_file_share_enabled           = (known after apply)
        name                               = "iopitnmsgssendingstfn01"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://iopitnmsgssendingstfn01.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "iopitnmsgssendingstfn01.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://iopitnmsgssendingstfn01.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "iopitnmsgssendingstfn01.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://iopitnmsgssendingstfn01.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "iopitnmsgssendingstfn01.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "italynorth" -> (known after apply)
      ~ primary_queue_endpoint             = "https://iopitnmsgssendingstfn01.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "iopitnmsgssendingstfn01.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://iopitnmsgssendingstfn01.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "iopitnmsgssendingstfn01.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://iopitnmsgssendingstfn01.z38.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "iopitnmsgssendingstfn01.z38.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ resource_group_name                = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (19 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
              - "Logging",
              - "Metrics",
            ] -> null
          - default_action             = "Deny" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_storage_account_network_rules.st_network_rules must be replaced
-/+ resource "azurerm_storage_account_network_rules" "st_network_rules" {
      ~ id                         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01" -> (known after apply)
      ~ ip_rules                   = [] -> (known after apply)
      ~ storage_account_id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnmsgssendingstfn01" # forces replacement -> (known after apply) # forces replacement
      ~ virtual_network_subnet_ids = [] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 22 to add, 0 to change, 22 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
